_app/_posts/soft/2016-04-11-debian安装dropbox.html
---
layout: post
title: debian安装dropbox
date: 2016-04-11
categories: 
- soft
tags: 
- debian
- dropbox
- 安装
- proxychains
- 代理
author: yefeiyu
excerpt: 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">安装准备</h2>
<div class="outline-text-2" id="text-1">
<p>
因为国内防火墙(GFW)对云盘提供商dropbox进行了屏弊,因为terminal无法直接下载安装,需要使用proxychains走代理。这一部分参见上篇文章《terminal通过proxychains翻墙》。<br  />
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">安装</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">通过deb包</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">cd ~
proxychains4 wget https://www.dropbox.com/download?dl=packages/debian/dropbox_2015.10.28_amd64.deb
sudo dpkg -i dropbox*.deb
&#65288;&#21024;&#38500;sudo dpkg -r dropbox)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">通过命令行安装无外设模式的 Dropbox</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"> cd ~
wget -O - <span style="color: #8b2252;">"https://www.dropbox.com/download?plat=lnx.x86_64"</span> | tar xzf -
</pre>
</div>
<p>
接着，从新建的 .dropbox-dist 文件夹运行 Dropbox 守护程序。<br  />
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">~/.dropbox-dist/dropboxd
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">配置</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c">proxychains dropbox proxy <span style="color: #228b22;">manual</span> <span style="color: #a0522d;">socks5</span> 127.0.0.1 1080
proxychains4 dropbox start -i
</pre>
</div>
</div>
</div>
